Revit 2027 API
DesignToFabricationConverter.GetPartialConvertFailureResults Method
 Gets the partial failure results.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PartialFailureResults> GetPartialConvertFailureResults()
Public Function GetPartialConvertFailureResults As IList(Of PartialFailureResults)
public:
IList<PartialFailureResults>^ GetPartialConvertFailureResults()
member GetPartialConvertFailureResults : unit -> IList<PartialFailureResults>
Return Value
IList<PartialFailureResults>
Remarks
 After the Convert method has been invoked and returned the DesignToFabricationConverterResult::Enum::PartialFailure, calls this method to get partial failure results.
See Also
Reference
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace